## Σύντομη βιογραφία του Dennis MacAlistair Ritchie.

O Dennis M. Ritchie γεννημένος τον Σεπτέβριο του 1941 στο Bronxville της Νεας Υορκης είναι ενας Αμερικανός επιστήμονας υπολογιστών,
ο οποίος εχει κερδίσει μαζί με τον συνάδελφο του Kenneth L. Thompson βραβείο Turing(απο τις ύψηστες τιμές στον κόσμο της πληροφορικής).
Μαζί κατάφεραν να δουλέψουν πανω στην ανάπτυξη της γενικής θεωρίας λειτουργικών συστημάτων και πιο συγκεκριμένα στην εφαρμογή του Unix 
λειτουργικού συστήματος!

Ο Dennis Ritchie είναι επίσης ευρέως γνωστός ως ο δημιουργός της προγραμματιστικής γλώσσας C. Η δημιουργία της C καθώς και ο ρόλος του 
στην ανάπτυξη της Unix τον έχουν καθιερώσει ως σημαντικό πρωτοπόρο της σύγχρονης πληροφορικής.Η C ακόμα και σήμερα χρησιμοποιείται 
στην ανάπτυξη λειτουργικών συστημάτων, καθώς πολλά εκπαιδευτικά ιδρύματα χρησιμοποιούν το λειτουργικό σύστημα Linux που βασίζεται στο 
Unix.

Μετά την επιτυχία του Unix, ο Ρίτσι συνέχισε την έρευνα σε λειτουργικά συστήματα και γλώσσες προγραμματισμού, με συνεισφορές στα 
λειτουργικά συστήματα Plan 9 και Inferno και στην γλώσσα προγραμματισμού Limbo.
